app/controllers/admin/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "updated_at", "created_at") VALUES ('Test 3', '2011-09-12 08:15:59.511428', '2011-09-12 08:15:59.511428')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "categories" SET "name" = 'Дополнительно', "updated_at" = '2011-09-12 13:56:45.526488' WHERE ("categories"."id" = 3)

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 2) LIMIT 1
DELETE FROM "categories" WHERE ("categories"."id" = 2)