app/controllers/admin/dashboard_controller.rb

  def index
    @orders = Order.today_orders
    @count_order_dishes = OrderDish.count_order_dishes
    @grand_total=0
    @count_order_dishes.each do |c|
---
SELECT "dishes".* FROM "dishes"
SELECT "orders".* FROM "orders" WHERE (DATE(created_at) = '2011-09-12')
SELECT SUM(dish.price) AS sum_id FROM "orders" WHERE (DATE(created_at) = '2011-09-12')
SELECT order_dishes.*, COUNT(*) AS cnt WHERE DATE(created_at) = 2011-09-12 FROM "order_dishes" GROUP BY order_dishes.dish_id