app/controllers/admin/dishes_controller.rb

  def edit
    @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE ("dishes"."id" = 1) LIMIT 1

  def create
    @dish = Dish.new(params[:dish])

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("weight", "price", "description", "category_id", "name", "created_at", "week_day", "updated_at") VALUES ('300', 10.0, 'Мойва жареная Гарнир картофельное пюре', 2, 'Стандарт Рыбное', '2011-09-12 21:09:47.298353', 3, '2011-09-12 21:09:47.298353')

  def update
    @dish = Dish.find(params[:id])

    respond_to do |format|
      if @dish.update_attributes(params[:dish])
---
SELECT "dishes".* FROM "dishes" WHERE ("dishes"."id" = 1) LIMIT 1
UPDATE "dishes" SET "price" = 10.0, "category_id" = 2, "updated_at" = '2011-09-12 21:08:36.332931', "week_day" = 4, "description" = 'Печень жареная с луком Гарнир картофельное пюре', "weight" = '300', "name" = 'Мясное' WHERE ("dishes"."id" = 4)