app/controllers/admin/orders_controller.rb

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 12) LIMIT 1
DELETE FROM "orders" WHERE ("orders"."id" = 12)