app/views/admin/dashboard/index.html.haml

SELECT "dishes".* FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 10))
SELECT SUM("dishes"."price") AS sum_id FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 10))
---
      %td.aright
        - order.dishes.each do |dish|
          =dish.name+" #{dish.category.name.to_s[0..3]} (#{dish.price})"
        %span.green="sum: #{order.dishes.sum('price')} Грн."