app/views/admin/orders/index.html.haml

        = link_to edit_order_path(order) do
          %span.green="#{order.dishes.sum('price')} Грн - "
---
SELECT SUM("dishes"."price") AS sum_id FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 12))