app/views/orders/index.html.haml

        = link_to edit_order_path(order) do
          =# order.dish.each {|x| puts x }
          %span.green="#{order.dishes.sum('price')} Грн - "
---
SELECT "dishes".* FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 10))
SELECT SUM("dishes"."price") AS sum_id FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 8))

  -else
    = link_to 'New Order', new_order_path unless @orders.last.created_at.to_date == Date.today
    .hidden{:style=>"display:none;"}="Order: #{@orders.last.created_at.to_date} Today: #{Date.today}"
---
SELECT "orders".* FROM "orders" WHERE ("orders".user_id = 1)