app/views/dishes/_list.html.haml

SELECT "dishes".* FROM "dishes" INNER JOIN "order_dishes" ON "dishes".id = "order_dishes".dish_id WHERE (("order_dishes".order_id = 3))
SELECT "orders".* FROM "orders" INNER JOIN "order_dishes" ON "orders".id = "order_dishes".order_id WHERE (("order_dishes".dish_id = 2))
---
      %tr{:class=>"color_#{dish.category.id}"}
        %td= check_box_tag "order[dish_ids][]", dish.id, @order.dishes.include?(dish)