app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" INNER JOIN "order_dishes" ON "orders".id = "order_dishes".order_id WHERE (("order_dishes".dish_id = 2))

  def show
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 1) LIMIT 1

  def edit
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" INNER JOIN "order_dishes" ON "orders".id = "order_dishes".order_id WHERE (("order_dishes".dish_id = 2))

  def create
    @order = Order.new(params[:order])
    @order.user = current_user

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("updated_at", "user_id", "created_at") VALUES ('2011-09-12 09:37:06.241261', NULL, '2011-09-12 09:37:06.241261')

  def update
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE ("orders".user_id = 1) AND ("orders"."id" = 6) LIMIT 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE ("orders".user_id = 2) AND ("orders"."id" = 4) LIMIT 1
DELETE FROM "orders" WHERE ("orders"."id" = 5)